##Завдання 3
# Для кожної унікальної комбінації Entity та Code або їх id порахуйте середнє, мінімальне,
# максимальне значення та суму для атрибута Number_rabies.
# Атрибут Number_rabies може містити порожні значення ‘’.
# - Результат відсортуйте за порахованим середнім значенням у порядку спадання.
# - Оберіть тільки 10 рядків.
    
##Завдання 4
# Для оригінальної або нормованої таблиці для колонки Year побудуйте з використанням вбудованих SQL-функцій:
# - атрибут, що створює дату першого січня відповідного року,
# 💡 Наприклад, якщо атрибут містить значення ’1996’, то значення нового атрибута має бути ‘1996-01-01’.
# - атрибут, що дорівнює поточній даті,
# - атрибут, що дорівнює різниці в роках двох вищезгаданих колонок.
# 💡 Перераховувати всі інші атрибути, такі як Number_malaria, не потрібно.
    
##Завдання 5
# Створіть і використайте функцію, що будує такий же атрибут, як і в попередньому завданні:
# функція має приймати на вхід значення року, а повертати різницю в роках між поточною датою
# та датою, створеною з атрибута року (1996 рік → ‘1996-01-01’).
    
##Завдання Additional
# Побудуйте функцію, що рахує кількість захворювань за певний період.
# Для цього треба поділити кількість захворювань на рік на певне число:
# 12 — для отримання середньої кількості захворювань на місяць,
# 4 — на квартал, 2 — на півріччя.
# Функція буде приймати два параметри: кількість захворювань на рік та довільний дільник.
# Не всі рядки містять число захворювань, вам необхідно буде відсіяти ті, що не мають чисельного значення (≠ ‘’).